-- phpMyAdmin SQL Dump
-- version 4.4.15.7
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1:3306
-- Время создания: Дек 13 2016 г., 20:40
-- Версия сервера: 5.5.50
-- Версия PHP: 5.3.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `irgorgua_social_surveys`
--

-- --------------------------------------------------------

--
-- Структура таблицы `answers`
--

CREATE TABLE IF NOT EXISTS `answers` (
  `id` int(11) NOT NULL,
  `survey_id` int(11) NOT NULL,
  `question_id` int(11) NOT NULL,
  `text` text NOT NULL,
  `comment` int(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB AUTO_INCREMENT=278 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `answers`
--

INSERT INTO `answers` (`id`, `survey_id`, `question_id`, `text`, `comment`) VALUES
(1, 1, 1, 'Да', 0),
(2, 1, 1, 'Нет (переход к вопросу №7)', 0),
(3, 1, 1, 'Затрудняюсь ответить', 0),
(4, 1, 2, 'Интер', 0),
(5, 1, 2, 'ICTV', 0),
(6, 1, 2, 'УТ-1 «Перший національний»', 0),
(7, 1, 2, 'УТ-2, «1+1»', 0),
(8, 1, 2, 'СТБ', 0),
(9, 1, 2, 'НТН', 0),
(10, 1, 2, '«Новый канал»', 0),
(11, 1, 2, '5-й канал', 0),
(12, 1, 2, 'ТРК «Украина»', 0),
(13, 1, 2, 'ТРК «Запорожье»', 0),
(14, 1, 2, 'ТРК «Алекс»', 0),
(15, 1, 2, 'ТВ-5', 0),
(16, 1, 2, 'ТВ-5 спорт', 0),
(17, 1, 2, 'Голд-ТВ', 0),
(18, 1, 2, 'МТМ', 0),
(19, 1, 2, 'АТВ', 0),
(20, 1, 2, 'Другой (укажите)', 1),
(21, 1, 2, 'Предпочтений нет', 0),
(28, 1, 3, 'Новости', 0),
(29, 1, 3, 'Сериалы', 0),
(30, 1, 3, 'Общественно-политические передачи', 0),
(31, 1, 3, 'Развлекательные передачи', 0),
(32, 1, 3, 'Спортивные передачи', 0),
(33, 1, 3, 'Художественные фильмы', 0),
(34, 1, 3, 'Документальные фильмы', 0),
(35, 1, 3, 'Криминальные новости, происшествия', 0),
(36, 1, 3, 'Мультфильмы', 0),
(37, 1, 3, 'Другая', 1),
(38, 1, 5, 'До 6.00', 0),
(39, 1, 5, '6.00-8.00', 0),
(40, 1, 5, '8.00-10.00', 0),
(41, 1, 5, '10.00-12.00', 0),
(44, 1, 5, '12.00-14.00', 0),
(45, 1, 5, '14.00-16.00', 0),
(46, 1, 5, '16.00-18.00', 0),
(47, 1, 5, '18.00-20.00', 0),
(48, 1, 5, '20.00-22.00', 0),
(49, 1, 5, 'Позже 22.00', 0),
(50, 1, 6, 'До 6.00', 0),
(51, 1, 6, '6.00-8.00', 0),
(52, 1, 6, '8.00-10.00', 0),
(53, 1, 6, '10.00-12.00', 0),
(54, 1, 6, '12.00-14.00', 0),
(55, 1, 6, '14.00-16.00', 0),
(56, 1, 6, '16.00-18.00', 0),
(57, 1, 6, '18.00-20.00', 0),
(58, 1, 6, '20.00-22.00', 0),
(59, 1, 6, 'Позже 22.00', 0),
(60, 1, 7, 'Да', 0),
(61, 1, 7, 'Нет (переход к вопросу №11)', 0),
(62, 1, 7, 'затрудняюсь ответить', 0),
(63, 1, 8, '«Ваша судьба»', 0),
(64, 1, 8, '«Верже»', 0),
(65, 1, 8, '«Горожанин-информ»', 0),
(66, 1, 8, '«Запорiзька правда»', 0),
(67, 1, 8, '«Запорiзька Сiч», «Перекур»', 0),
(68, 1, 8, '«Запорожский пенсионер»', 0),
(69, 1, 8, '«Индустриальное Запорожье», «Панорама»', 0),
(70, 1, 8, '«Искра»', 0),
(71, 1, 8, '«Комсомольская правда в Украине»', 0),
(72, 1, 8, '«МИГ»', 0),
(73, 1, 8, '«Мрия»', 0),
(74, 1, 8, '«Наше время»', 0),
(75, 1, 8, '«Остров Свободы»', 0),
(76, 1, 8, '«Позиция»', 0),
(77, 1, 8, '«Правда»', 0),
(78, 1, 8, '«Репортер Запорожье»', 0),
(79, 1, 8, '«Суббота плюс»', 0),
(80, 1, 8, '«Улица Заречная»', 0),
(81, 1, 8, 'Газету своего предприятия', 0),
(82, 1, 8, 'Другую (укажите какую)', 1),
(83, 1, 8, 'Предпочтений нет', 0),
(84, 1, 9, 'Спорт', 0),
(85, 1, 9, 'События в регионе, городе', 0),
(86, 1, 9, 'События в стране', 0),
(87, 1, 9, 'Культура', 0),
(88, 1, 9, 'Программа телепередач', 0),
(89, 1, 9, 'Досуговая рубрика', 0),
(90, 1, 9, 'Криминальные новости, происшествия', 0),
(91, 1, 9, 'Реклама, частные объявления', 0),
(92, 1, 9, 'Политика, власть', 0),
(96, 13, 34, 'ответ1', 0),
(97, 13, 34, 'ответ2', 1),
(100, 1, 10, 'Алло', 0),
(101, 1, 10, 'Карьера', 0),
(102, 1, 10, 'Новая работа', 0),
(103, 1, 10, 'Парковка', 0),
(104, 1, 10, 'Привоз', 0),
(105, 1, 10, 'Работа для всех', 0),
(106, 1, 10, 'Работа и учеба', 0),
(107, 1, 10, 'Результат', 0),
(108, 1, 10, 'Розница', 0),
(109, 1, 10, 'Рынок плюс', 0),
(110, 1, 10, 'Товары и Услуги', 0),
(111, 1, 10, 'Трудоустройство', 0),
(112, 1, 10, 'Туча', 0),
(113, 1, 10, 'Другое издание (указать)', 1),
(114, 1, 10, 'Предпочтений нет', 0),
(115, 1, 11, 'VIP-Club', 0),
(116, 1, 11, 'Афиша', 0),
(117, 1, 11, 'Бардачок авто', 0),
(118, 1, 11, 'Ваша Свадьба', 0),
(119, 1, 11, 'Журнал «Свой»', 0),
(120, 1, 11, 'Запорожский строительный каталог', 0),
(121, 1, 11, 'Мир ремонта', 0),
(122, 1, 11, 'Мужской клуб', 0),
(123, 1, 11, 'Невеста', 0),
(124, 1, 11, 'Премьер Дайджест', 0),
(125, 1, 11, 'Теленеделя', 0),
(126, 1, 11, 'Телескоп', 0),
(127, 1, 11, 'Чудо', 0),
(128, 1, 11, 'Эксклюзив туризма', 0),
(129, 1, 11, 'Другой журнал', 1),
(130, 1, 11, 'Предпочтений нет', 0),
(131, 1, 12, 'Да', 0),
(132, 1, 12, 'Нет (переход к вопросу №16)', 0),
(133, 1, 12, 'Затрудняюсь ответить', 0),
(134, 1, 13, 'Ищу информацию в сфере личных интересов (работа, учеба, отдых и хобби и т.д.)', 0),
(135, 1, 13, 'Играю в интерактивные игры', 0),
(136, 1, 13, 'Провожу время в социальных сетях', 0),
(137, 1, 13, 'Общаюсь на форумах', 0),
(138, 1, 13, 'Читаю новости', 0),
(139, 1, 13, 'Работаю с е-mail', 0),
(140, 1, 13, 'Свой вариант', 1),
(141, 1, 15, '«Вконтакте»', 0),
(142, 1, 15, '«Фейсбук»', 0),
(143, 1, 15, '«Твиттер»', 0),
(144, 1, 15, '«Одноклассники»', 0),
(145, 1, 15, 'Другая (укажите какая)', 1),
(146, 1, 15, 'Не пользуюсь социальной сетью', 0),
(147, 1, 16, 'Да', 0),
(148, 1, 16, 'Нет (переход к вопросу № 22)', 0),
(149, 1, 16, 'Затрудняюсь ответить', 0),
(150, 1, 17, 'Kiss-FM', 0),
(151, 1, 17, 'Авторадио', 0),
(152, 1, 17, 'Великий Луг', 0),
(153, 1, 17, 'Гала-радио', 0),
(154, 1, 17, 'Европа плюс', 0),
(155, 1, 17, 'Запорожье', 0),
(156, 1, 17, 'Люкс-FM', 0),
(157, 1, 17, 'Мелодия', 0),
(158, 1, 17, 'Наше радио', 0),
(159, 1, 17, 'Перец-ФМ', 0),
(160, 1, 17, 'Радио Рокс', 0),
(161, 1, 17, 'Радио-3', 0),
(162, 1, 17, 'Ретро FM', 0),
(163, 1, 17, 'Русское радио', 0),
(164, 1, 17, 'Хит-FM', 0),
(165, 1, 17, 'Шансон', 0),
(166, 1, 17, 'Шарманка', 0),
(167, 1, 17, 'Юниверс', 0),
(168, 1, 17, 'Локальную радиосеть', 0),
(169, 1, 17, 'Радиотрансляцию', 0),
(170, 1, 17, 'Другое (укажите какое)', 1),
(171, 1, 17, 'Предпочтений нет', 0),
(172, 1, 19, 'До 6.00', 0),
(173, 1, 19, '6.00-8.00', 0),
(174, 1, 19, '8.00-10.00', 0),
(175, 1, 19, '10.00-12.00', 0),
(176, 1, 19, '12.00-14.00', 0),
(177, 1, 19, '14.00-16.00', 0),
(178, 1, 19, '16.00-18.00', 0),
(179, 1, 19, '18.00-20.00', 0),
(180, 1, 19, '20.00-22.00', 0),
(181, 1, 19, 'Позже 22.00', 0),
(182, 1, 20, 'До 6.00', 0),
(183, 1, 20, '6.00-8.00', 0),
(184, 1, 20, '8.00-10.00', 0),
(185, 1, 20, '10.00-12.00', 0),
(186, 1, 20, '12.00-14.00', 0),
(187, 1, 20, '14.00-16.00', 0),
(188, 1, 20, '16.00-18.00', 0),
(189, 1, 20, '18.00-20.00', 0),
(190, 1, 20, '20.00-22.00', 0),
(191, 1, 20, 'Позже 22.00', 0),
(192, 1, 21, 'Дома', 0),
(193, 1, 21, 'В офисе (на работе/на учебе)', 0),
(194, 1, 21, 'В плеере', 0),
(195, 1, 21, 'В машине', 0),
(196, 1, 21, 'В общественном транспорте', 0),
(197, 1, 21, 'На даче', 0),
(198, 1, 22, 'Мужской', 0),
(199, 1, 22, 'Женский', 0),
(200, 1, 23, '18-24 лет', 0),
(201, 1, 23, '25-34 лет', 0),
(202, 1, 23, '35-44 лет', 0),
(203, 1, 23, '45-54 лет', 0),
(204, 1, 23, '55-64 лет', 0),
(205, 1, 23, '65 лет и старше', 0),
(206, 1, 24, 'Неоконченное среднее', 0),
(207, 1, 24, 'Среднее', 0),
(208, 1, 24, 'Среднее специальное', 0),
(209, 1, 24, 'Неоконченное высшее', 0),
(210, 1, 24, 'Высшее', 0),
(211, 1, 24, 'Второе высшее', 0),
(212, 1, 25, 'Военнослужащий, работник МВД, СБУ', 0),
(213, 1, 25, 'Представитель высшего управленческого персонала', 0),
(214, 1, 25, 'Руководитель среднего звена', 0),
(215, 1, 25, 'Домохозяйка', 0),
(216, 1, 25, 'Государственный служащий', 0),
(217, 1, 25, 'Квалифицированный рабочий', 0),
(218, 1, 25, 'Представитель творческой профессии (дизайнер, фотограф и т.д)', 0),
(219, 1, 25, 'Научный работник', 0),
(220, 1, 25, 'Неквалифицированный рабочий', 0),
(221, 1, 25, 'Работник культуры и образования', 0),
(222, 1, 25, 'Работник сельского хозяйства', 0),
(223, 1, 25, 'Работник сферы услуг', 0),
(224, 1, 25, 'Работник торговли', 0),
(225, 1, 25, 'Специалист технического профиля', 0),
(226, 1, 25, 'Спортсмен', 0),
(227, 1, 25, 'Студент', 0),
(228, 1, 25, 'Предприниматель', 0),
(229, 1, 25, 'Пенсионер', 0),
(230, 1, 25, 'Работник здравоохранения', 0),
(231, 1, 25, 'Безработный', 0),
(232, 1, 25, 'Свой вариант', 1),
(233, 1, 26, 'до 500', 0),
(234, 1, 26, '501 - 1000 гpн', 0),
(235, 1, 26, '1001-2000 гpн', 0),
(236, 1, 26, '2001-3000 гpн', 0),
(237, 1, 26, '3001 - 4000 гpн', 0),
(238, 1, 26, '4001 – 5000 грн', 0),
(239, 1, 26, '5001 – 6000 грн', 0),
(240, 1, 26, '6001 – 7000 грн', 0),
(241, 1, 26, '7001 – 8000 грн', 0),
(242, 1, 26, '8001 – 9000 грн', 0),
(243, 1, 26, '9001 – 10 000 грн', 0),
(244, 1, 26, '10 000грн и более', 0),
(245, 1, 27, 'Да', 0),
(246, 1, 27, 'Нет', 0),
(247, 1, 28, 'Жовтневый район', 0),
(248, 1, 28, 'Заводский район', 0),
(249, 1, 28, 'Коммунарский район', 0),
(250, 1, 28, 'Ленинский район', 0),
(251, 1, 28, 'Орджоникидзевский район', 0),
(252, 1, 28, 'Шевченковский район', 0),
(253, 1, 28, 'Хортицкий район', 0),
(254, 14, 36, 'Полностью удовлетворен', 0),
(255, 14, 36, 'Скорее удовлетворен', 0),
(256, 14, 36, 'Скорее не удовлетворен', 0),
(257, 14, 36, 'Полностью не удовлетворен', 0),
(258, 14, 36, 'Затрудняюсь ответить', 0),
(259, 14, 36, 'Не знаю такого человека', 0),
(261, 14, 37, 'Новатор', 0),
(262, 14, 37, 'Опытный хозяйственник', 0),
(263, 14, 37, 'Влиятельный политик', 0),
(264, 14, 37, 'Борец за справедливость', 0),
(265, 14, 37, 'Простой, из народа.', 0),
(266, 14, 37, 'Неординарная личность', 0),
(268, 14, 37, 'Сильная личность', 0),
(269, 14, 37, 'Работник медицины и здравоохранения', 0),
(270, 14, 37, 'Работник органов власти', 0),
(271, 14, 37, 'Работник милиции (силовых ведомств)', 0),
(272, 14, 37, 'Патриот', 0),
(273, 14, 37, 'Фермер', 0),
(274, 14, 37, 'Представлять политическую партию, которой я симпатизирую', 0),
(275, 14, 37, 'Иметь опыт управления предприятием (или бизнесом)', 0),
(276, 14, 37, 'Честный, порядочный человек', 0),
(277, 14, 37, 'Свой вариант', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `questions`
--

CREATE TABLE IF NOT EXISTS `questions` (
  `id` int(11) NOT NULL,
  `survey_id` int(11) NOT NULL,
  `type` tinyint(4) NOT NULL DEFAULT '0',
  `text` text NOT NULL,
  `title` text NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=39 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `questions`
--

INSERT INTO `questions` (`id`, `survey_id`, `type`, `text`, `title`) VALUES
(1, 1, 0, 'Смотрите ли ВЫ телевизор?', ''),
(2, 1, 1, 'Какие телевизионные каналы Вы смотрите чаще всего? (можно выбрать не более трех вариантов)', ''),
(3, 1, 1, 'Какие рубрики более всего привлекают Ваше внимание?', '(можно выбрать не более трех вариантов)'),
(4, 1, 2, 'Назовите три любимых передачи на Запорожских каналах (Алекс, Запоріжжя…)', ''),
(5, 1, 1, 'В какой промежуток времени Вы обычно смотрите ТВ в будние дни?', '(можно выбрать не более трех вариантов)'),
(6, 1, 1, 'В какой промежуток времени Вы обычно смотрите ТВ в выходные дни?', '(можно выбрать не более трех вариантов)'),
(7, 1, 0, 'Читаете ли ВЫ газеты?', ''),
(8, 1, 1, 'Какие общественно-политические газеты Вы читаете, или регулярно просматриваете?', '(можно выбрать не более трех вариантов)'),
(9, 1, 1, 'На информацию, из каких рубрик Вы обращаете наибольшее внимание?', '(можно выбрать не более трех вариантов)'),
(10, 1, 1, 'Какие специализированные газеты ВЫ читаете или регулярно просматриваете?', '(можно выбрать не более трех вариантов)'),
(11, 1, 1, 'Какие журналы Вы читаете или регулярно просматриваете?', '(можно выбрать не более трех вариантов)'),
(12, 1, 0, 'Пользуетесь ли ВЫ Интернетом?', ''),
(13, 1, 1, 'С какой целью ВЫ обычно пользуетесь Интернетом?', '(можно выбрать не более трех вариантов)'),
(14, 1, 2, 'Какие из НОВОСТНЫХ Интернет-сайтов Вы посещаете чаще всего?', '(не более трех вариантов ответа)'),
(15, 1, 0, 'Какой социальной сетью Вы пользуетесь чаще всего?', '(только один вариант ответа)'),
(16, 1, 0, 'Слушаете ли ВЫ радио?', ''),
(17, 1, 1, 'Какие радиостанции Вы слушаете чаще всего?', '(можно выбрать не более трех вариантов)'),
(18, 1, 2, 'Назовите последнюю запомнившуюся рекламу, услышанную по радио', ''),
(19, 1, 1, 'В какой промежуток времени Вы обычно слушаете радио в будние дни?', '(можно выбрать не более трех вариантов)'),
(20, 1, 1, 'В какой промежуток времени Вы обычно слушаете радио в выходные дни?', '(можно выбрать не более трех вариантов)'),
(21, 1, 1, 'Где Вы обычно слушаете радио?', '(можно выбрать не более трех вариантов)'),
(22, 1, 0, 'Ваш пол?', ''),
(23, 1, 0, 'Ваш возраст?', ''),
(24, 1, 0, 'Ваше образование?', ''),
(25, 1, 0, 'Ваш род занятий?', ''),
(26, 1, 0, 'Уровень дохода на одного члена семьи', ''),
(27, 1, 0, 'Есть ли в Вашей семье автомобиль?', ''),
(28, 1, 0, 'Район проживания', ''),
(29, 1, 2, 'Телефон респондента', ''),
(34, 13, 0, 'вопрос1', 'титл1'),
(36, 14, 0, 'Народного депутата Украины 8-го созыва ', 'Как Вы оцениваете деятельность следующих представителей власти и общественно-политических деятелей?'),
(37, 14, 1, 'Каким, по Вашему мнению, должен быть Народный депутат Украины?', '(можно выбрать несколько вариантов)'),
(38, 14, 2, 'Почему Вы выбрали именно этого кандидата?', 'Запишите со слов респондента');

-- --------------------------------------------------------

--
-- Структура таблицы `results`
--

CREATE TABLE IF NOT EXISTS `results` (
  `id` int(11) NOT NULL,
  `survey_id` int(11) NOT NULL,
  `interviewer_id` int(11) NOT NULL,
  `time_start` bigint(20) NOT NULL,
  `time_finish` bigint(20) NOT NULL,
  `latitude` double NOT NULL DEFAULT '0',
  `longitude` double NOT NULL DEFAULT '0',
  `audio_name` text NOT NULL,
  `audio_path` text NOT NULL,
  `result` text NOT NULL,
  `result_path` text NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=63 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `results`
--

INSERT INTO `results` (`id`, `survey_id`, `interviewer_id`, `time_start`, `time_finish`, `latitude`, `longitude`, `audio_name`, `audio_path`, `result`, `result_path`) VALUES
(32, 14, 3, 1480370003, 1480370024, 0, 0, 's14-i3-1480370003.3gpp', '../results/survey_14/interviewer_3/s14-i3-1480370003.3gpp', '1;1;0;1;0;1;0;0;0;0;0;0;0;0;0;0;0;"это сука текст с пробелами";', '../results/survey_14/interviewer_3/1480370003.csv'),
(33, 14, 3, 1480370096, 1480370115, 0, 0, 's14-i3-1480370096.3gpp', '../results/survey_14/interviewer_3/s14-i3-1480370096.3gpp', '1;0;0;0;0;0;0;0;0;1;0;1;0;0;0;0;"попгнгап";"ддшррнгпшпг";', '../results/survey_14/interviewer_3/1480370096.csv'),
(34, 14, 3, 1480371655, 1480371686, 0, 0, 's14-i3-1480371655.3gpp', '../results/survey_14/interviewer_3/s14-i3-1480371655.3gpp', '1;0;0;0;0;0;0;0;0;0;1;0;1;0;0;0;"свой вариант";"текст лоппо о";', '../results/survey_14/interviewer_3/1480371655.csv'),
(61, 1, 3, 1480780648, 1480780675, 47.881878, 35.0708848, 's1-i3-1480780648.3gpp', '../results/survey_1/interviewer_3/s1-i3-1480780648.3gpp', '"3";0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;"";0;0;0;0;0;0;0;0;0;0;"";"";0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;"";0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;"";0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;"";0;0;0;0;0;0;0;0;"";"";"моя соц сеть uebana";0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;"";0;"";0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;0;"";', '../results/survey_1/interviewer_3/1480780648.csv'),
(62, 1, 3, 1480781129, 1480781342, 47.8819034, 35.070899, 's1-i3-1480781129.3gpp', '../results/survey_1/interviewer_3/s1-i3-1480781129.3gpp', '"1";1;0;0;1;0;0;0;0;0;0;0;0;0;0;0;0;"zp tv";0;0;1;0;0;0;1;0;0;0;"порно";"кобза моя кобза";0;0;0;1;0;1;0;0;0;0;0;0;1;0;0;0;0;0;0;0;"3";0;1;0;1;0;0;1;0;0;0;0;0;0;0;0;0;0;0;0;"";0;0;0;0;1;0;0;0;1;0;1;0;0;0;0;0;0;0;0;0;0;0;0;"";0;0;0;0;0;1;0;0;0;1;0;0;0;0;0;"";0;"1";1;0;0;0;1;0;"смотрю фильмы онлайн";"бандеровские";"анунах";"2";0;0;0;0;1;0;0;0;0;1;0;0;0;0;0;0;0;0;0;0;"радио кабаны";0;"оголоша крапка ком";0;0;0;0;1;0;0;0;0;0;0;1;0;0;0;0;0;0;0;0;0;1;0;1;0;0;"1";"2";"5";"17";"12";"1";"4";"+380938687469";', '../results/survey_1/interviewer_3/1480781129.csv');

-- --------------------------------------------------------

--
-- Структура таблицы `surveys`
--

CREATE TABLE IF NOT EXISTS `surveys` (
  `id` int(11) NOT NULL,
  `date` bigint(20) NOT NULL DEFAULT '0',
  `title` text NOT NULL,
  `distribution` int(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `surveys`
--

INSERT INTO `surveys` (`id`, `date`, `title`, `distribution`) VALUES
(1, 1476900000, 'СМИ опрос', 1),
(13, 1477602000, 'VPL опрос', 1),
(14, 1477774800, 'Исследование 82 округ', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` int(11) NOT NULL,
  `fullname` text NOT NULL,
  `login` text NOT NULL,
  `paswrd` text NOT NULL,
  `role` int(11) NOT NULL DEFAULT '0',
  `expired` bigint(20) NOT NULL DEFAULT '0'
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `fullname`, `login`, `paswrd`, `role`, `expired`) VALUES
(1, 'root', 'root', '$2y$10$OUnvFzu71vPog9UEamI2je513h.K8nYr55jD7A.XJbiSByt8guJ2G', 1, 0),
(2, 'Хренов Василий Петрович', 'hrenov-vp', '$2y$10$5G4O.ZAdse9oTKsvX1jJxucwZuyqW3Y0qEzulBgvbIU2aVEEkgCea', 0, 1479505352),
(3, 'Иванов Иван Иванович', 'ivanov-ii', '$2y$10$VGpqFDr8DPTHwpFFJAD41usYjBceSfULqGLGBSSGjVeWHgIr3g60S', 0, 1480867009),
(4, 'Семипупенко Алексей Радиславович', 'semipypenko-ar', '$2y$10$rbClX/Mx/afxGF0ChvtbceviqwHwPb9bs11atgX/pkNIwJS8KuISK', 0, 1479243234);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `answers`
--
ALTER TABLE `answers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `survey_id` (`survey_id`),
  ADD KEY `question_id` (`question_id`);

--
-- Индексы таблицы `questions`
--
ALTER TABLE `questions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `survey_id` (`survey_id`);

--
-- Индексы таблицы `results`
--
ALTER TABLE `results`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `surveys`
--
ALTER TABLE `surveys`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `answers`
--
ALTER TABLE `answers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=278;
--
-- AUTO_INCREMENT для таблицы `questions`
--
ALTER TABLE `questions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=39;
--
-- AUTO_INCREMENT для таблицы `results`
--
ALTER TABLE `results`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=63;
--
-- AUTO_INCREMENT для таблицы `surveys`
--
ALTER TABLE `surveys`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=15;
--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=5;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
